[
    {
        "title":"Gemal Concepts",
        "id":"1.1",
        "desc":"The GEMAL modeling language is built up of 7 basic modeling concepts (simply called 'things'); process (a), product (b), location (c), person (d), goal (e), organisation (f) and capability (g). These concepts had been outlined by professor John Krogstie in his language proposal for GEMAL. Their meanings and visual notations remained largely unchanged throughout my project.",
        "image":"gemal_concepts.png"
    },
	    {
        "title":"Gemal Metamodel",
        "id":"1.2",
        "desc":"Metamodel for the GEMAL modeling language, illustrating possible concepts and relationships between them. The model was made using the GEMAL implementation.",
        "image":"gemal_metamodel.png"
    },
    {
        "title":"Gemal Viewstyles",
        "id":"1.3",
        "desc":"Visual notations of the implemented modeling language can be customised by choosing between the basic (left) and advanced (right) view-styles. The advanced view-style trades increased visual complexity, for more expressiveness; attributes including internal complexity, completeness, modality and state are displayed visually on modeling objects. ",
        "image":"paper_viewstyles.png"
    },
    {
        "title":"Gemal States",
        "id":"1.4",
        "desc":"State space and state transitions of GEMAL's modeling concepts was one of many topics that was designed as a part of this project, partially based on the Bunge-Wand-Weber ontology and Frank Moody's principles for visual notations of conceptual modeling languages. The model in the picture was made using GEMAL notations and software.",
        "image":"gemal_states.png"
    },
    {
        "title":"Gemal Istar",
        "id":"1.5",
        "desc":"A GEMAL model (left) that was made based on an I* model during one of the many case studies of the project. The figure to the right shows how a GEMAL object may contain several composite objects - here illustrated by an 'Organising committe' that, among other things, owns a 'Website' product and a 'Handle payments' process.",
        "image":"gemal_istar.png"
    }
]